# LbfDashFt Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..LbfDashFt Property
SymbolTypeId Class See Also
---
Symbol lbf-ft, indicating unit Pound force feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId LbfDashFt { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LbfDashFt As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LbfDashFt {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace